jeremysalwen/Mowgli/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/*
 * NON BLOCKING TIMERS
 */
static nbt_t ros_nbt;
static nbt_t publish_nbt;
static nbt_t motors_nbt;
static nbt_t panel_nbt;
static nbt_t imu_nbt;
static nbt_t status_nbt;

/*
 * reboot flag, if true we reboot after next publish_nbt
 */
static bool reboot_flag = false;

extern "C" void CommandHighLevelStatusMessageCb(const mower_msgs::HighLevelStatus &msg)
{
	high_level_status = msg;
	if (msg.gps_quality_percent < 0.9)
	{
		PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_OFF);
	}
	else
	{
		PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_ON);
	}
	if (target_blade_on_off)
	{
		if (BLADEMOTOR_bActivated)
		{
			#ifdef PANEL_LED_2H
			PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_FLASH_SLOW);
			#endif
		}
		else
		{
			#ifdef PANEL_LED_2H
			PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_ON);
			#endif
		}
	}
	else
	{
		#ifdef PANEL_LED_2H
		PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_OFF);
		#endif			
	}

	/* led on in function of the current state of openmower*/
	switch (msg.state & 0b11111)
	{
	case mower_msgs::HighLevelStatus::HIGH_LEVEL_STATE_AUTONOMOUS:
		PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_ON);
		PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);

		switch ((msg.state >> mower_msgs::HighLevelStatus::SUBSTATE_SHIFT))
		{
		case mower_msgs::HighLevelStatus::SUBSTATE_1:
			PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_ON);
			PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_OFF);
			PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_OFF);
			main_eOpenmowerStatus = OPENMOWER_STATUS_MOWING;
			break;
		case mower_msgs::HighLevelStatus::SUBSTATE_2:
			PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_OFF);
			PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_ON);
			PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_OFF);
			main_eOpenmowerStatus = OPENMOWER_STATUS_DOCKING;
			break;
		case mower_msgs::HighLevelStatus::SUBSTATE_3:
			PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_OFF);
			PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_OFF);
			PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_ON);
			main_eOpenmowerStatus = OPENMOWER_STATUS_UNDOCKING;
			break;
		case mower_msgs::HighLevelStatus::SUBSTATE_4:
		default:
			PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_OFF);
			PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_OFF);
			PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_OFF);
			/* unknow status */
			main_eOpenmowerStatus = OPENMOWER_STATUS_MAX_STATUS;
			break;
		}
		break;

	case mower_msgs::HighLevelStatus::HIGH_LEVEL_STATE_RECORDING:
		PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
		PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_ON);
		main_eOpenmowerStatus = OPENMOWER_STATUS_RECORD;
		break;

	case mower_msgs::HighLevelStatus::HIGH_LEVEL_STATE_IDLE:
	default:
		PANEL_Set_LED(PANEL_LED_S1, PANEL_LED_OFF);
		PANEL_Set_LED(PANEL_LED_S2, PANEL_LED_OFF);
		PANEL_Set_LED(PANEL_LED_4H, PANEL_LED_OFF);
		PANEL_Set_LED(PANEL_LED_6H, PANEL_LED_OFF);
		PANEL_Set_LED(PANEL_LED_8H, PANEL_LED_OFF);
		main_eOpenmowerStatus = OPENMOWER_STATUS_IDLE;
		left_dir = right_dir = 1;
		left_speed = right_speed = blade_on_off = target_blade_on_off = 0;
		break;
	}
}
/*
 * receive and parse cmd_vel messages
 * actual driving (updating drivemotors) is done in the drivemotors_nbt
 */
extern "C" void CommandVelocityMessageCb(const geometry_msgs::Twist &msg)
{	
	double l_fVx;
	double l_fVz;

	last_cmd_vel = nh.now();
	if (main_eOpenmowerStatus == OPENMOWER_STATUS_IDLE)
	{
		return;
	}
	l_fVz = msg.angular.z;
	l_fVx = msg.linear.x;
	// calculate twist speeds to add/substract
	float left_twist_mps = -1.0 * l_fVz * WHEEL_BASE * 0.5;
	float right_twist_mps = l_fVz * WHEEL_BASE * 0.5;

	// add them to the linear speed
	float left_mps = l_fVx + left_twist_mps;
	float right_mps = l_fVx + right_twist_mps;

	// cap left motor speed to MAX_MPS
	if (left_mps > MAX_MPS)
	{
		left_mps = MAX_MPS;
	}
	else if (left_mps < -1. * MAX_MPS)
	{
		left_mps = -1. * MAX_MPS;
	}
	// cap right motor speed to MAX_MPS
	if (right_mps > MAX_MPS)
	{
		right_mps = MAX_MPS;
	}
	else if (right_mps < -1. * MAX_MPS)
	{
		right_mps = -1. * MAX_MPS;
	}

	// set directions
	left_dir = (left_mps >= 0) ? 1 : 0;
	right_dir = (right_mps >= 0) ? 1 : 0;

	// set drivemotors PWM values
	left_speed = abs(left_mps * PWM_PER_MPS);
	right_speed = abs(right_mps * PWM_PER_MPS);

	//	debug_printf("left_mps: %f (%c)  right_mps: %f (%c)\r\n", left_mps, left_dir?'F':'R', right_mps, right_dir?'F':'R');
}

uint8_t CDC_DataReceivedHandler(const uint8_t *Buf, uint32_t len)
{

	ringbuffer_put(&rb, Buf, len);
	return CDC_RX_DATA_HANDLED;
}

/*
 * Update various chatters topics
 */
extern "C" void chatter_handler()
{
	if (NBT_handler(&publish_nbt))
	{
		#ifdef ROS_PUBLISH_MOWGLI
			imu_onboard_temperature = IMU_Onboard_ReadTemp();
		#endif

		HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN); // flash LED

		// reboot if set via cbReboot (mowgli/Reboot)
		if (reboot_flag)
		{
			nh.spinOnce();
			NVIC_SystemReset();
			// we never get here ...
		}
	}
}

/*
 *  Drive Motors handler
 *  Blade Motor handler
 */
extern "C" void motors_handler()
{
	if (NBT_handler(&motors_nbt))
	{
		blade_on_off = target_blade_on_off;
		if (Emergency_State())
		{
			DRIVEMOTOR_SetSpeed(0, 0, 0, 0);
			blade_on_off = 0;
		}
		else
		{
			// if the last velocity cmd is older than 1sec we stop the drive motors
			last_cmd_vel_age = nh.now().toSec() - last_cmd_vel.toSec();
			if (last_cmd_vel_age > 0.2)
			{
				DRIVEMOTOR_SetSpeed(0, 0, 0, 0);
			}
			else
			{
				DRIVEMOTOR_SetSpeed(left_speed, right_speed, left_dir, right_dir);
			}

			if (last_cmd_vel_age > 25) // Blade can take up to 10 seconds to switch on
			{
				blade_on_off = 0;
			}
		}
		BLADEMOTOR_Set(blade_on_off, blade_direction);
	}
}

/*
 *  Keyboard/LED Panel handler
 */
extern "C" void panel_handler()
{
	if (NBT_handler(&panel_nbt))
	{
		PANEL_Tick();
		if (buttonupdated == 1 && buttoncleared == 0)
		{
			debug_printf("ROS: panel_nbt() - buttonstate changed\r\n");
			mower_msgs::HighLevelControlSrvRequest highControlRequest;
			mower_msgs::HighLevelControlSrvResponse highControlResponse;
			if (buttonstate[PANEL_BUTTON_DEF_S1])
			{
				highControlRequest.command = mower_msgs::HighLevelControlSrvRequest::COMMAND_S1;
			}
			if (buttonstate[PANEL_BUTTON_DEF_S2])
			{
				highControlRequest.command = mower_msgs::HighLevelControlSrvRequest::COMMAND_S2;
			}
			if (buttonstate[PANEL_BUTTON_DEF_LOCK])
			{
				highControlRequest.command = mower_msgs::HighLevelControlSrvRequest::COMMAND_RESET_EMERGENCY;
			}
			if (buttonstate[PANEL_BUTTON_DEF_SUN])
			{
				/*seems a little risky, a wrong touch and hops need to redo the maps*/
				// highControlRequest.command = mower_msgs::HighLevelControlSrvRequest::COMMAND_DELETE_MAPS;
			}
			if (buttonstate[PANEL_BUTTON_DEF_START])
			{
				highControlRequest.command = mower_msgs::HighLevelControlSrvRequest::COMMAND_START;
			}
			if (buttonstate[PANEL_BUTTON_DEF_HOME])
			{
				highControlRequest.command = mower_msgs::HighLevelControlSrvRequest::COMMAND_HOME;
			}
			svcHighLevelControl.call(highControlRequest, highControlResponse);
			buttonupdated = 0;
		}
	}
}
#if OPTION_ULTRASONIC == 1
/* \fn ultrasonic_handler
 * \brief Send ultrasonic range to openmower by rosserial
 * is called when receiving the ultrasonic broad response
 */
extern "C" void ultrasonic_handler(void)
{
	ultrasonic_left_msg.header.stamp = nh.now();
	ultrasonic_left_msg.header.frame_id = "ultrasonic_left_link";
	ultrasonic_right_msg.header.stamp = nh.now();
	ultrasonic_right_msg.header.frame_id = "ultrasonic_right_link";

	ultrasonic_left_msg.radiation_type = 0;
	ultrasonic_left_msg.field_of_view = 0.5; /* 30°*/
	ultrasonic_left_msg.min_range = 0.30;
	ultrasonic_left_msg.max_range = 2.0;
	ultrasonic_left_msg.range = 0.5 * (ultrasonic_left_msg.range) + 0.5 * (float)(ULTRASONICSENSOR_u32GetLeftDistance()) / 10000;

	ultrasonic_right_msg.radiation_type = 0;
	ultrasonic_right_msg.field_of_view = 0.5; /* 30°*/
	ultrasonic_right_msg.min_range = 0.30;
	ultrasonic_right_msg.max_range = 2.0;
	ultrasonic_right_msg.range = 0.5 * (ultrasonic_right_msg.range) + 0.5 * (float)(ULTRASONICSENSOR_u32GetRightDistance()) / 10000;

	pubLeftUltrasonic.publish(&ultrasonic_left_msg);
	pubRightUltrasonic.publish(&ultrasonic_right_msg);
}
#endif

